### Forest: Benchmark Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.benchmark.data.external.sources_tar: Reading...
module.benchmark.data.local_file.init: Reading...
module.benchmark.data.local_file.init: Read complete after 0s [id=61568774520f7bb170b5b3ba54c7380eadcee10a]
module.benchmark.data.digitalocean_project.forest_project: Reading...
module.benchmark.data.digitalocean_ssh_keys.keys: Reading...
module.benchmark.data.external.sources_tar: Read complete after 0s [id=-]
module.benchmark.data.local_file.sources: Reading...
module.benchmark.data.local_file.sources: Read complete after 0s [id=20c0100b7836d876e54c81ae928fcb74c1aea065]
module.benchmark.data.digitalocean_ssh_keys.keys: Read complete after 1s [id=ssh_keys/4003270040538543685]
module.benchmark.digitalocean_droplet.forest: Refreshing state... [id=370114215]
module.benchmark.data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.benchmark.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.benchmark.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-08-15T20:14:11Z" -> (known after apply)
      ~ disk                 = 300 -> (known after apply)
      ~ id                   = "370114215" -> (known after apply)
      ~ ipv4_address         = "165.232.71.244" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.8" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "forest-benchmark"
      ~ price_hourly         = 0.19494 -> (known after apply)
      ~ price_monthly        = 131 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
        ]
      ~ urn                  = "do:droplet:370114215" -> (known after apply)
      ~ user_data            = "2622f2d89d04ae885fe924d853fafedf0e5946ba" -> "c8db2c95a6e8fc333bc336dfc3329022c34114c9" # forces replacement
      ~ vcpus                = 2 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.benchmark.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:370114215",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ ip = [
      - [
          - "165.232.71.244",
        ],
      + [
          + (known after apply),
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>